In [ ]:
#Task 1: Which crops need most/least water?

In [1]:
import pandas as pd
import numpy as np

In [2]:
from pandas import DataFrame

In [3]:
from pandas.errors import EmptyDataError

In [4]:
db = pd.DataFrame(pd.read_csv('New_2016.csv', sep=';', header=1))

In [5]:
db.head()

,Country Name,Country FAO Code,Country ISO2,Item Name,Item FAO Code,Item Category,Unit of Measure,2016
0,Austria,11,AT,Apples,515,Fruits,m3/ton,251.289993
1,Austria,11,AT,Asparagus,367,Vegetables,m3/ton,2152.719971
2,Austria,11,AT,Carrots and turnips,426,Vegetables,m3/ton,88.053802
3,Austria,11,AT,Cherries,531,Fruits,m3/ton,687.744019
4,Austria,11,AT,"Chillies and peppers, green",401,Vegetables,m3/ton,49.357101

In [6]:
db.describe()

       Country FAO Code  Item FAO Code          2016
count        225.000000     225.000000    225.000000
mean         148.066667     401.800000    585.799797
std           71.536517     139.993559   1761.778390
min           11.000000      56.000000      0.000000
25%           84.000000     372.000000     82.842598
50%          150.000000     401.000000    159.078003
75%          203.000000     521.000000    519.427002
max          272.000000     560.000000  21696.099609

In [7]:
db.shape

(225, 8)

In [8]:
db.dtypes

Country Name         object
Country FAO Code      int64
Country ISO2         object
Item Name            object
Item FAO Code         int64
Item Category        object
Unit of Measure      object
2016                float64
dtype: object

In [ ]:
#Task1a: Which crops need most water?

In [9]:
mask = db.loc[:,'2016']>5000
db.loc[mask,'2016']=np.nan

In [10]:
top_item = db.groupby('Item Name')['2016'].mean().sort_values(ascending=False)
top_item.index[0]

'Cherries'

In [11]:
db.groupby('Country Name')['2016'].mean().sort_values(ascending=False)

Country Name
Morocco        1070.761258
Greece          547.131133
Spain           505.430340
Hungary         434.847174
Germany         414.730453
Italy           394.936249
Turkey          386.794358
Romania         370.971670
Serbia          359.136073
Poland          346.962699
Portugal        345.717337
France          342.681313
Austria         338.906050
Belgium         210.827391
Netherlands     129.662278
Name: 2016, dtype: float64

In [16]:
mask = db.loc[:,'2016']>5000
db.loc[mask,'2016']=np.nan

In [17]:
top_item = db.groupby('Item Name')['2016'].mean().sort_values(ascending=False)
top_item.index[1]

'Asparagus'

In [18]:
top_item = db.groupby('Item Name')['2016'].mean().sort_values(ascending=False)
top_item.index[2]

'Maize'

In [19]:
top_item = db.groupby('Item Name')['2016'].mean().sort_values(ascending=False)
top_item.index[3]

'Grapes'

In [20]:
top_item = db.groupby('Item Name')['2016'].mean().sort_values(ascending=False)
top_item.index[4]

'Pears'

In [21]:
top_item = db.groupby('Item Name')['2016'].mean().sort_values(ascending=False)
top_item.index[5]

'Peaches and nectarines'

In [ ]:
#Task 2: In which countries do crops generally need most water and should not be imported?

In [12]:
mask_cherries = db.loc[:,'Item Name'] == top_item.index[0]
db.loc[mask_cherries,['2016','Country Name']].sort_values('2016',ascending = False)

            2016 Country Name
108  4152.379883      Morocco
48   3012.179932      Germany
198  2309.409912        Spain
93   2257.370117        Italy
33   1474.069946       France
63   1419.510010       Greece
78   1372.270020      Hungary
183  1270.900024       Serbia
18   1156.859985      Belgium
138   927.682007       Poland
3     687.744019      Austria
213   657.968994       Turkey
168   458.584015      Romania
123          NaN  Netherlands
153          NaN     Portugal

In [13]:
mask = db.loc[:,'2016']>5000
db.loc[mask,'2016']=np.nan

In [14]:
top_item = db.groupby('Item Name')['2016'].mean().sort_values(ascending=False)
top_item.index[1]

'Asparagus'

In [15]:
mask_asparagus = db.loc[:,'Item Name'] == top_item.index[1]
db.loc[mask_asparagus,['2016','Country Name']].sort_values('2016',ascending = False)

            2016 Country Name
1    2152.719971      Austria
196  1921.000000        Spain
106  1873.810059      Morocco
61   1769.880005       Greece
211  1767.810059       Turkey
76   1515.270020      Hungary
31   1302.079956       France
91   1085.510010        Italy
46   1057.619995      Germany
121   761.036011  Netherlands
16    599.791016      Belgium
136   417.325012       Poland
151     0.000000     Portugal
166     0.000000      Romania
181     0.000000       Serbia

In [22]:
mask_maize = db.loc[:,'Item Name'] == top_item.index[1]
db.loc[mask_maize,['2016','Country Name']].sort_values('2016',ascending = False)

            2016 Country Name
1    2152.719971      Austria
196  1921.000000        Spain
106  1873.810059      Morocco
61   1769.880005       Greece
211  1767.810059       Turkey
76   1515.270020      Hungary
31   1302.079956       France
91   1085.510010        Italy
46   1057.619995      Germany
121   761.036011  Netherlands
16    599.791016      Belgium
136   417.325012       Poland
151     0.000000     Portugal
166     0.000000      Romania
181     0.000000       Serbia

In [23]:
top_item = db.groupby('Item Name')['2016'].mean().sort_values(ascending=False)
top_item.index[2]

'Maize'

In [25]:
mask_grapes = db.loc[:,'Item Name'] == top_item.index[1]
db.loc[mask_grapes,['2016','Country Name']].sort_values('2016',ascending = False)

            2016 Country Name
1    2152.719971      Austria
196  1921.000000        Spain
106  1873.810059      Morocco
61   1769.880005       Greece
211  1767.810059       Turkey
76   1515.270020      Hungary
31   1302.079956       France
91   1085.510010        Italy
46   1057.619995      Germany
121   761.036011  Netherlands
16    599.791016      Belgium
136   417.325012       Poland
151     0.000000     Portugal
166     0.000000      Romania
181     0.000000       Serbia

In [26]:
top_item = db.groupby('Item Name')['2016'].mean().sort_values(ascending=False)
top_item.index[3]

'Grapes'

In [27]:
mask_pears = db.loc[:,'Item Name'] == top_item.index[1]
db.loc[mask_pears,['2016','Country Name']].sort_values('2016',ascending = False)

            2016 Country Name
1    2152.719971      Austria
196  1921.000000        Spain
106  1873.810059      Morocco
61   1769.880005       Greece
211  1767.810059       Turkey
76   1515.270020      Hungary
31   1302.079956       France
91   1085.510010        Italy
46   1057.619995      Germany
121   761.036011  Netherlands
16    599.791016      Belgium
136   417.325012       Poland
151     0.000000     Portugal
166     0.000000      Romania
181     0.000000       Serbia

In [28]:
top_item = db.groupby('Item Name')['2016'].mean().sort_values(ascending=False)
top_item.index[4]

'Pears'

In [29]:
mask_peachesandnectarines = db.loc[:,'Item Name'] == top_item.index[1]
db.loc[mask_peachesandnectarines,['2016','Country Name']].sort_values('2016',ascending = False)

            2016 Country Name
1    2152.719971      Austria
196  1921.000000        Spain
106  1873.810059      Morocco
61   1769.880005       Greece
211  1767.810059       Turkey
76   1515.270020      Hungary
31   1302.079956       France
91   1085.510010        Italy
46   1057.619995      Germany
121   761.036011  Netherlands
16    599.791016      Belgium
136   417.325012       Poland
151     0.000000     Portugal
166     0.000000      Romania
181     0.000000       Serbia

In [30]:
top_item = db.groupby('Item Name')['2016'].mean().sort_values(ascending=False)
top_item.index[5]

'Peaches and nectarines'

'Cherries'